# St7GetNumLibraries

Returns the number of material libraries currently available.

long St7GetNumLibraries(long LibraryType, long* NumLibraries)

Input Parameters
LibraryType

One of lbMaterial, lbBeamSection, lbSectionGeometry, lbComposite, lbReinforcementLayout,
lbCreepDefinition or lbLoadPathTemplate.

Output Parameters
NumLibraries

Number of libraries.